from dependence import cls
import time
import random
from operator import add


def road_3():

    cls()
    print('===========================================')
    print('Вас приветствует программа сложения списков')
    print('===========================================')
    input('Нажмите Enter для продолжения...')
    cls()
    time.sleep(1) 
    
    while True:
        a = [random.randint(1,10) for i in range (5)]
        b = [random.randint(1,10) for i in range (5)]
        c = list(map(add, a, b))
        print('Программа сформировала 2 случайных списка из 5 значений каждый, в диапазоне от 1 до 10.')
        print('=======================================================================================')
        print('')
        print('Список "a":', a)
        print('Список "b":', b)
        print('Список "c":', c)
        print('')
        print('=======================================================================================')
        print('В переменной "с", действительно хранится список. Это мы можем проверить используя')
        print('команду "type", передав в неё в качестве аргумента нашу переменную "с" и увидим тип данных')
        print('хранящихся в переменной:', type(c), 'список "c" является результатом поэлементного сложения обеих списков.')
        print('')

        choice = input('Хотите сформировать новые списки? (Y/N): ')
        if choice in ('Y', 'y'):
            cls()
            continue
        elif choice in ('N', 'n'):
            cls()
            print('===========================================================')
            print('Спасибо что воспользовались нашими авиалиниями. Досвидания!')
            print('===========================================================')
            time.sleep(2)
            cls()
            break
        while choice not in ('Y', 'y', 'N', 'n'):
            cls()
            choice = input('Введите корректное значение, (Y/N): ')